__all__ = [
    'rabbit_madeline4',
    'madeline_name_list4',
    'madeline_data4'
]

rabbit_madeline4 = [
]

madeline_name_list4 = {
    '1':[
        '很舒服的玛德琳',
        '害怕玛德琳',
        '蒙眼玛德琳',
        '对话框',
        '酱一',
        '酱二',
        '酱三',
        '酱四',
        '酱五',
        '8旗动画',
        '象牙小船',
        '草莓酱通关动画',
        '小雨伞',
        '荷塘月色',
        '千空之寺',
        '意念力',
        'LEVEL UP',
        '红宝石',
        '黄玉',
        '珍珠',
        '星型宝石',
        '紫宝石',
        '青宝石',
        '粉云',
        '钥匙',
        '冰球',
        '开门',
        '伤心坏德琳',
        '苍渊冰芯',
        '赤核幼焰',
        '辉霆棱芯',
        '烬穹晶砂',
        '虚界星屑',
        '请选择你的拍屏导师',
        '现在是幻想时间',
        'summitstare',
        '酱一心“门”',
        'skate.ppt',
        '油桶',
        '草莓酱纪念碑',
        '我有抑郁症',
        '没人疼就去爬山吧',
        '全都是外星人！',
        '你的死亡次数',
        '给我玩蔚蓝',
    ],
    '2':[
        '水晶草莓',
        '水晶速通铜草莓',
        '水晶飞草莓',
        'Strawberry Jam',
        "概率论与数理统计",
        'Sapphire Ruins',
        '画游',
        '水莓',
        '紫色飞草莓',
        '速通爆炸',
        '核心草莓',
        '黄宝石胖头鱼',
        '霓虹胖头鱼',
        '彩虹小羊',
        '小飞机',
        '骷髅钥匙',
        '爆竹胖头鱼',
        '苍渊冰魄',
        '赤核熔心',
        '辉霆棱心',
        '烬穹晶髓',
        '虚界星核',
        "Conqueror's Peak",
        '74',
        '山 顶',
        '弹球炼狱',
        '烈冕号的太阳',
        '拥抱蜂后',
        'trans心',
        'maya我们喜欢你',
        '草莓树',
        '有内鬼！',
        'wow月梅',
        '船员玛德琳',
        '绿弹簧',
        'Celeste玩家交流群',
        '运动员玛德琳',
        'ninz炸弹',
        '酱四大厅',
        '封神雕塑',
        '正在思考的玛德琳',
    ],
}

madeline_data4 = {
    '1':{
        '1':{
            'name': '很舒服的玛德琳',
            'description':
            '她很舒服，不要打扰她'
        },
        '2':{
            'name': '害怕玛德琳',
            'description':
            '缆车嘎吱嘎吱的晃荡，玛德琳害怕极了…… 快去请金羽毛！'
        },
        '3':{
            'name': '蒙眼玛德琳',
            'description':
            '玛德琳带上了眼罩，准备摸黑进行她的下一次爬山，可能她要爬的是9d？'
        },
        '4':{
            'name': '对话框',
            'description':
            '仅仅是一个对话框，仅此而已'
        },
        '5':{
            'name': '酱一',
            'description':
            '非常简单，散步图，没有任何花里胡哨的技巧'
        },
        '6':{
            'name': '酱二',
            'description':
            '增加一点小技巧，但仍在官图范围内，简单好玩，眩晕除外'
        },
        '7':{
            'name': '酱三',
            'description':
            '水温升高，挑战开始，难度中等，有挑战性，（另一座山？'
        },
        '8':{
            'name': '酱四',
            'description':
            '杨桃超新星！！！！ 好听的音乐，好玩的图！难度？先别管它了！'
        },
        '9':{
            'name': '酱五',
            'description':
            '你已经是一个成熟的蔚蓝外星人了！'
        },
        '10':{
            'name': '8旗动画',
            'description':
            '嗯 有7旗动画了，当然也要有8旗动画啊~',
            'gif' : True
        },
        '11':{
            'name': '象牙小船',
            'description':
            '继杂鱼之旅之后小船抵达了下一个观光点---- 象牙！'
        },
        '12':{
            'name': '草莓酱通关动画',
            'description':
            '过关啦! 果...果酱溢出来了！！！！',
            'gif' : True
        },
        '13':{
            'name': '小雨伞',
            'description':
            '雨落玫瑰的小雨伞，喜欢这张抓水母耗体力的变种图吗？',
            'gif' : True
        },
        '14':{
            'name': '荷塘月色',
            'description':
            '超级机关双重加速高速图，一顿操作猛如虎，啪啪啪啪啪啪啪（烟花声）'
        },
        '15':{
            'name': '千空之寺',
            'description':
            '优质散步图，音乐好听，风景好看，果冻好玩'
        },
        '16':{
            'name': '意念力',
            'description':
            '红伞伞，白杆杆......玛德琳吃了后冲的神志不清'
        },
        '17':{
            'name': 'LEVEL UP',
            'description':
            '升级了！ 你现在可以在空中冲刺两次了（为什么可以在空中冲刺？',
            'gif' : True
        },
        '18':{
            'name': '红宝石',
            'description':
            '玛德琳在爬山途中被风刮跑了！ 不过她发现了这块红宝石！（也是水晶之心的融合材料）',
            'gif' : True
        },
        '19':{
            'name': '黄玉',
            'description':
            '爬山途中在旅馆休息（雾）时看到的神秘黄色水晶，合成7a水晶之心的重要原材料',
            'gif' : True
        },
        '20':{
            'name': '珍珠',
            'description':
            '神庙的密藏，7a水晶之心高级融合材料（老值钱了',
            'gif' : True
        },
        '21':{
            'name': '星型宝石',
            'description':
            '玛德琳在山脚下捡到的宝石，五个角似乎在说还有五个宝石（？）',
            'gif' : True
        },
        '22':{
            'name': '紫宝石',
            'description':
            '蓝紫色的宝石，是玛德琳在废墟中发现的，真奇怪，废墟里怎么会有宝石？',
            'gif' : True
        },
        '23':{
            'name': '青宝石',
            'description':
            '玛德琳在横竖交错的果冻中发现了这个，不过可能时间太久了掉色了（',
            'gif' : True
        },
        '24':{
            'name': '粉云',
            'description':
            '一次性的云，把握住机会，要记得：失去就不再回来！',
            'gif' : True
        },
        '25':{
            'name': '钥匙',
            'description':
            '作用很简单的一把钥匙，帮你打开一扇锁上的门。但是为什么任意一把钥匙能打开任意一把锁呢？',
            'gif' : True
        },
        '26':{
            'name': '冰球',
            'description':
            '小心了！ 虽然它现在可以踩，但是它变成火球的时候是致命的！',
            'gif' : True
        },
        '27':{
            'name': '开门',
            'description':
            '你拿到了钥匙，打开了挡路的门！',
            'gif' : True
        },
        '28':{
            'name': '伤心坏德琳',
            'description':
            '坏德琳伤心了！',
            'gif' : True
        },
        '29':{
            'name': '苍渊冰芯',
            'description':
            '冰魄能量压缩后的核心形态，可镶嵌于武器上释放霜冻脉冲，低温蓝光如呼吸般明灭。',
            'gif' : True
        },
        '30':{
            'name': '赤核幼焰',
            'description':
            '熔心的初生形态，虽体积微小却能持续辐射热能，常被用作便携式能量炉核心。',
            'gif' : True
        },
        '31':{
            'name': '辉霆棱芯',
            'description':
            '棱心的能量收束体，可投射出雷电护盾，迷你化后更易与机械装置共鸣。',
            'gif' : True
        },
        '32':{
            'name': '烬穹晶砂',
            'description':
            '晶髓破碎后的微粒集合体，携带时会在地面拖曳出灼热光痕，可重组为临时护甲。',
            'gif' : True
        },
        '33':{
            'name': '虚界星屑',
            'description':
            '星核分裂出的不稳定碎片，虽无实体却能寄生在生物体内增幅精神力，危险且迷人。',
            'gif' : True
        },
        '34':{
            'name': '请选择你的拍屏导师',
            'description':
            '所以是不会截屏吗……',
            'jpg' : True
        },
        '35':{
            'name': '现在是幻想时间',
            'description':
            '玛德琳在幻想自己拿了202草莓，要不要叫醒她呢...',
            'jpg' : True
        },
        '36':{
            'name': 'summitstare',
            'description':
            '这个山怎么在盯着你...'
        },
        '37':{
            'name': '酱一心“门”',
            'description':
            '这个门还挺好看的'
        },
        '38':{
            'name': 'skate.ppt',
            'description':
            '蓝鸟居然还会滑板（'
        },
        '39':{
            'name': '油桶',
            'description':
            '玛德琳开船所需的燃料'
        },
        '40':{
            'name': '草莓酱纪念碑',
            'description':
            '上面有草莓酱的所有mapper'
        },
        '41':{
            'name': '我有抑郁症',
            'description':
            '好像玛德琳还真有……',
            'jpg' : True
        },
        '42':{
            'name': '没人疼就去爬山吧',
            'description':
            '玛德琳是浑身疼，我们是手指疼',
            'jpg' : True
        },
        '43':{
            'name': '全都是外星人！',
            'description':
            '被群u(外星人)环绕的玛德琳，看起来像是被下云了'
        },
        '44':{
            'name': '你的死亡次数',
            'description':
            '一人一个草莓就原谅了',
            'jpg' : True
        },
        '45':{
            'name': '给我玩蔚蓝',
            'description':
            '对，说你呢',
            'jpg' : True
        },
    },
    '2':{
        '1':{
            'name': '水晶草莓',
            'description':
            '晶莹剔透的魔法果实，外形如同水晶雕琢而成。',
            'gif' : True
        },
        '2':{
            'name': '水晶速通铜草莓',
            'description':
            '表面覆盖着古老的铜色纹路，仿佛承载着时间的重量。',
            'gif' : True
        },
        '3':{
            'name': '水晶飞草莓',
            'description':
            '外形与普通水晶草莓相似，两侧生长着由纯净魔力凝聚而成的羽翼。',
            'gif' : True
        },
        '4':{
            'name': 'Strawberry Jam',
            'description':
            '广受蔚蓝玩家喜爱的大型mod, 还等什么，快去玩！'
        },
        '5':{
            'name': '概率论与数理统计',
            'description':
            '玛德琳的统计学教科书（确信）',
            'jpg' : True
        },
        '6':{
            'name': 'Sapphire Ruins',
            'description':
            '蓝宝石遗迹，一张小短图'
        },
        '7':{
            'name': '画游',
            'description':
            '在画界畅游吧，有很多奇妙机制的大型mod'
        },
        '8':{
            'name': '水莓',
            'description':
            '呀 这颗草莓汁水太饱满了，一碰就爆开来了 ! WET!',
            'gif' : True
        },
        '9':{
            'name': '紫色飞草莓',
            'description':
            '好奇怪的草莓，也许是翅膀和草莓有排异反应吧（确信',
            'gif' : True
        },
        '10':{
            'name': '速通爆炸',
            'description':
            '速通草莓：你跑的太墨迹了，这边死一下 那边多按一下的，就这还敢带着我？炸死你！',
            'gif' : True
        },
        '11':{
            'name': '核心草莓',
            'description':
            '烈焰之心，莓有极限！\n这是生长于核心的草莓，一个火力与果味兼具的神秘角色，头戴冰蓝王冠，脸庞燃烧着炽热能量。别被可爱的外表骗了，它可是战场上最甜美又最危险的存在——每一击都带着爆浆般的威力，专治各种不服！',
            'gif' : True
        },
        '12':{
            'name': '黄宝石胖头鱼',
            'description':
            '这只河豚闪耀着黄玉般的光辉，既有奢华的外表，又不失河豚的“爆脾气”！据说，捕捉到它的人会迎来好运，但前提是你得先避开它的致命一刺！',
            'gif' : True
        },
        '13':{
            'name': '霓虹胖头鱼',
            'description':
            '这是一只特别的粉红河豚，外表呆萌，但是和其他河豚一样暗藏杀机！一旦受到惊吓，它会迅速膨胀，形成天然防御。别被它的可爱迷惑，惹毛了它，分分钟给你来个“河豚弹击”！更恐怖的是，有时候他会藏在背景里面偷偷的给你一个惊喜！',
            'gif' : True
        },
        '14':{
            'name': '彩虹小羊',
            'description':
            '它不是普通的羊，它是一只踏着彩虹而来的小可爱！每走一步都洒下一片绚烂，传说跟随它的人会被幸福与好运包围，有极大概率在下一抓抓到藏品哦！但小心别被它的可爱闪到眼睛。 ',
            'gif' : True
        },
        '15':{
            'name': '小飞机',
            'description':
            '看似可爱的外表下隐藏着大恐怖！喜欢它的手感吗？ 嗯?',
            'gif' : True
        },
        '16':{
            'name': '骷髅钥匙',
            'description':
            '看起来既神秘又危险，仿佛能开启某个被遗忘已久的禁忌之门！传说只有真正的勇者才能找到它，而它的作用不仅仅是开锁——也许还会释放出沉睡在深渊中的远古力量。你敢带着它继续前行吗？小心，门后那玩意可不是闹着玩的！',
            'gif' : True
        },
        '17':{
            'name': '爆竹胖头鱼',
            'description':
            '爆竹当然会爆炸啦，这可比河豚爆炸合理多了，就是玛德琳不会被炸死有点奇怪（？',
            'gif' : True
        },
        '18':{
            'name': '苍渊冰魄',
            'description':
            '深海冰川中淬炼的永冻结晶，表面流动着液态寒光，触碰时会在空中凝结出冰晶矩阵。',
            'gif' : True
        },
        '19':{
            'name': '赤核熔心',
            'description':
            '地脉岩浆凝成的灼热晶核，内部悬浮着永不熄灭的火焰星屑，高温使其周围空气扭曲。',
            'gif' : True
        },
        '20':{
            'name': '辉霆棱心',
            'description':
            '吸收雷暴能量的闪电晶簇，表面布满金色裂痕，激活时会引发电磁风暴。',
            'gif' : True
        },
        '21':{
            'name': '烬穹晶髓',
            'description':
            '火山灰与落日余晖交织形成的琥珀晶体，内部封存着古代文明的记忆残影。',
            'gif' : True
        },
        '22':{
            'name': '虚界星核',
            'description':
            '陨落星域中滋生的反物质水晶，表面漂浮着暗紫色星云漩涡，能扭曲空间结构。',
            'gif' : True
        },
        '23':{
            'name': "Conqueror's Peak",
            'description':
            '另一座山! 征服者山！ 去征服它吧！'
        },
        '24':{
            'name': '74',
            'description':
            '超级好玩无冲咖啡图，这旅店是一秒也呆不下去了'
        },
        '25':{
            'name': '山 顶',
            'description':
            '再爬一次这座山吧！ 但这次，难度会翻十倍！'
        },
        '26':{
            'name': '弹球炼狱',
            'description':
            '噩梦弹球图，抽奖抽奖继续抽奖，银练不了一点'
        },
        '27':{
            'name': '烈冕号的太阳',
            'description':
            '杨桃超新星的早期形态（'
        },
        '28':{
            'name': '拥抱蜂后',
            'description':
            '在蜂窝里安抚蜂后的madeline',
            'gif' : True
        },
        '29':{
            'name': 'trans心',
            'description':
            'trans rights!!!',
            'gif' : True
        },
        '30':{
            'name': 'maya我们喜欢你',
            'description':
            '这画风怎么那么熟悉...',
            'gif' : True
        },
        '31':{
            'name': '草莓树',
            'description':
            '2猎的草莓树就是这个（'
        },
        '32':{
            'name': '有内鬼！',
            'description':
            '蜂蜜工厂里面进入了一个内鬼，员工们正在寻找他...'
        },
        '33':{
            'name': 'wow月梅',
            'description':
            '这个才是正常的月梅，不是how(',
            'gif' : True
        },
        '34':{
            'name': '船员玛德琳',
            'description':
            'red is sus',
            'gif' : True
        },
        '35':{
            'name': '绿弹簧',
            'description':
            '与暴风雪，白果冻和成语的绝佳搭配！'
        },
        '36':{
            'name': 'Celeste玩家交流群',
            'description':
            '什么时候Celeste伯特交流群群也能有2000人……',
            'jpg' : True
        },
        '37':{
            'name': '运动员玛德琳',
            'description':
            '玛德琳平u好像可以达到>40km/h的速度（',
            'jpg' : True
        },
        '38':{
            'name': 'ninz炸弹',
            'description':
            '红温的ninz，在一猎好像有正常版本...',
            'gif' : True
        },
        '39':{
            'name': '酱四大厅',
            'description':
            '本大厅含有这些要素...',
            'jpg' : True
        },
        '40':{
            'name': '封神雕塑',
            'description':
            '看到这个的时候应该是要封神了吧'
        },
        '41':{
            'name': '正在思考的玛德琳',
            'description':
            '所以这面怎么过啊……',
            'jpg' : True
        },
    },
}